In [93]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import sklearn.linear_model as LM
from word2number import w2n
import math

In [69]:
df=pd.read_csv('homeprices.csv')

In [70]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [71]:
meadianvalue=df['bedrooms'].median()

In [72]:
meadianvalue

4.0

In [73]:
df['newbedroom']=df['bedrooms'].fillna(4.0)

In [74]:
df

   area  bedrooms  age   price  newbedroom
0  2600       3.0   20  550000         3.0
1  3000       4.0   15  565000         4.0
2  3200       NaN   18  610000         4.0
3  3600       3.0   30  595000         3.0
4  4000       5.0    8  760000         5.0
5  4100       6.0    8  810000         6.0

In [75]:
df.drop(['bedrooms'], axis=1,inplace=True)

In [76]:
df

   area  age   price  newbedroom
0  2600   20  550000         3.0
1  3000   15  565000         4.0
2  3200   18  610000         4.0
3  3600   30  595000         3.0
4  4000    8  760000         5.0
5  4100    8  810000         6.0

In [77]:
X_data=df.drop(['price'],axis=1)

In [78]:
X_data

   area  age  newbedroom
0  2600   20         3.0
1  3000   15         4.0
2  3200   18         4.0
3  3600   30         3.0
4  4000    8         5.0
5  4100    8         6.0

In [79]:
Y_data=df['price']

In [22]:
Y_data

0    550000
1    565000
2    610000
3    595000
4    760000
5    810000
Name: price, dtype: int64

In [80]:
lmodel=LM.LinearRegression()

In [81]:
lmodel.fit(X_data,Y_data)

LinearRegression()

In [82]:
lmodel.predict([[3000,40,3]])

array([498408.25158031])